import React, {useState} from 'react';
import './Form.scss';
import './Popup.scss';
import Modal from 'react-bootstrap/Modal';

export const Popup = ({errors}) => {

  const [lgShow, setLgShow] = useState(false);
  return (
    <div>
      <label onClick={() => setLgShow(true)}  className={`form__block-label ${errors && "error"}`}> Я погоджуюся з політикою конфіденційності</label>
      <Modal  size="lg"
        show={lgShow}
        onHide={() => setLgShow(false)}
        aria-labelledby="example-modal-sizes-title-lg">
        <Modal.Header closeButton>
          <h1>Політика конфіденційності</h1>
        </Modal.Header>
        <Modal.Body>
          <div className="modal__text-block">
            <p>Дана Політика конфіденційності (далі за текстом – «Політика») регулює відносини у сфері захисту персональних даних відвідувачів веб-сайту www.a-help.com.ua (далі за текстом – «Веб-сайт»), який належить Благодійній організації «Благодійний фонд „А-ХЕЛП УКРАЇНА“» (код ЄДРПОУ 44773154, адреса місцезнаходження: Україна, 61121, Харківська обл., місто Харків, вул. Валентинівська, будинок 58А, квартира 333, 334 (далі за текстом – «Фонд»).</p>
          </div>
          <h3 className="modal__text-title">1.ЗАГАЛЬНІ ПОЛОЖЕННЯ</h3>
          <div className="modal__text-block">
            <p>1.1. В даній Політиці терміни вживаються у наступному значенні:</p>
            <p>• база персональних даних - іменована сукупність упорядкованих персональних даних в електронній формі та/або у формі картотек персональних даних;</p>
            <p>• згода суб’єкта персональних даних - добровільне волевиявлення фізичної особи (за умови її поінформованості) щодо надання дозволу на обробку її персональних даних відповідно до сформульованої мети їх обробки, висловлене у формі, що дає змогу зробити висновок про надання згоди;</p>
            <p>• обробка персональних даних - будь-яка дія або сукупність дій, таких як збирання, реєстрація, накопичення, зберігання, адаптування, зміна, поновлення, використання і поширення (розповсюдження, реалізація, передача), знеособлення, знищення персональних даних, у тому числі з використанням інформаційних (автоматизованих) систем;</p>
            <p>• персональні дані - відомості чи сукупність відомостей про фізичну особу, яка ідентифікована або може бути конкретно ідентифікована;</p>
            <p>• суб’єкт персональних даних - фізична особа, персональні дані якої обробляються;</p>
            <p>• третя особа - будь-яка особа, за винятком суб’єкта персональних даних, володільця чи розпорядника персональних даних;</p>
            <p>всі інші терміни в Політиці вживаються у значенні, визначеному чинним законодавством України, включаючи ратифіковані в Україні міжнародні нормативно-правові акти.</p>
            <p>1.2. Дана Політика розроблена з метою інформування суб’єктів персональних даних про порядок обробки їх персональних даних під час відвідування/користування Веб-сайтом, а також з метою забезпечення захисту їх персональних даних під час такої обробки.</p>
            <p>1.3. Дана Політика, а також діяльність Фонду, пов’язана із збиранням, обробкою, зберіганням та іншими правомірними діями щодо персональних даних, регулюється:</p>
            <p>• Конституцією України;</p>
            <p>• Законом України «Про захист персональних даних» від 01.06.2010 р. №2287-VI;</p>
            <p>• іншими чинними нормативно-правовими актами України, які регулюють питання захисту персональних даних;</p>
            <p>• ратифікованими в України міжнародними нормативно-правовими актами.</p>
            <p>До правовідносин, які виникають у Фонду у зв’язку з обробкою персональних даних резидентів іноземних юрисдикцій, також застосовується право (в тому числі міжнародне), національні та міжнародні нормативноправові акти, що регулюють питання захисту персональних даних резидентів таких країн.</p>
            <p>1.4. Володільцем персональних даних, які обробляються у зв’язку з відвідуванням/використанням опцій Веб-сайту є Фонд. Фонд має право доручити повністю або частково обробку персональних даних третім особам на підставі договору, укладеного відповідно до вимог чинного законодавства.</p>
            <p>1.5. Фізична особа є суб’єктом персональних даних за даною Політикою, якщо вона є відвідувачем Вебсайту, в т.ч. якщо вона використовує будь-які опції, доступні на Веб-сайті.</p>
            <p>1.6. Фонд гарантує, що:</p>
            <p>• дотримується належної практики та нормативних вимог щодо захисту персональних даних;</p>
            <p>• захищає права суб’єктів персональних даних;</p>
            <p>• запобігає ризику порушення безпеки обробки персональних даних.</p>
            <p>1.7. Метою обробки персональних даних, отриманих в процесі функціонування Веб-сайту, є здійснення Фонду своєї статутної діяльності.</p>
            <p>1.8. Розміщення даної Політики за посиланням, вказаним в п. 4.1. цієї Політики, є повідомленням суб’єктів персональних даних про Володільця, склад та зміст персональних даних, що збираються у зв’язку з відвідуванням/використанням Веб-сайту, про права таких суб’єктів, мету збору їх персональних даних та третіх осіб, яким можуть передаватись такі персональні дані.</p>
          </div>
          <h3 className="modal__text-title">2. ОБРОБКА ПЕРСОНАЛЬНИХ ДАНИХ</h3>
          <div className="modal__text-block">
            <p>2.1. Фонд може збирати та обробляти наступну інформацію про Вас:</p>
            <p>• Інформація, яку Ви надаєте Фонду: це інформація про Вас, яку Ви надаєте шляхом: використання Вебсайту та опцій Веб-сайту, надання благодійної допомоги (пожертви) за допомогою опцій Веб-сайту, комунікації з Фондом через опції, доступні на Веб-сайті, тощо.</p>
            <p>• Інформація про Вас, яка збирається Веб-сайтом та іншими системами: 1) якщо Ви відвідуєте Веб-сайт, треті особи можуть збирати певну інформацію про Вас та Ваше відвідування, так як тип та версія Вашого браузера, а також сторінки на Веб-сайті, які Ви відвідуєте, адресу інтернет-протоколу (ІР); 2) якщо Ви контактуєте із співробітниками Фонду за допомогою Веб-сайту або інших засобів електронного зв’язку.</p>
            <p>• Інформація, яку збирають треті особи про Вас на Веб-сайті шляхом виконання дій: це інформація про Вас, яку Ви надаєте третім особам (наприклад, Facebook, Google, Twitter), використовуючи опції для обміну в соціальних мережах, доступні на Веб-сайті, при переходів з однієї сторінки на іншу або шляхом перегляду матеріалів, що мають посилання (відкриваються) на інші платформи (веб-сайти).</p>
            <p>2.2. Те, яким чином Фонд обробляє Ваші персональні дані, залежить від того, як ви використовуєте Веб-сайт та взаємодієте з ним. Частина інформації може надаватись безпосередньо Вами під час використання Вебсайту або в інший спосіб; іншу інформацію Фонд може збирати та обробляти самостійно за допомогою автоматизованих технологій, що використовуються на Веб-сайті.</p>
            <p>2.3. Правові підстави обробки даних: при відвідуванні Веб-сайту Фонд обробляє ваші персональні дані, якщо 1) Фонд отримав вашу згоду на таку обробку, 2) в інших випадках, визначених чинним законодавством. У деяких випадках Фонд може мати юридичне зобов’язання обробляти ваші персональні дані або оброблятиме ваші персональні дані для формування, здійснення або захисту правових претензій.</p>
            <p>2.4. Механізми автоматизованої обробки: Фонд та треті особи можуть використовувати технології автоматизованої обробки інформації для обробки інформації в деяких розділах Веб-сайту. Фонд може використовувати файли cookie для зберігання контенту та налаштувань, що дозволяє Фонду обробляти стандартну інформацію, яку ваш браузер надсилає певним веб-сайтам, які ви відвідуєте, наприклад, вашу IP-адресу, тип і мову браузера, а також сайт, з якого ви перейшли, сторінки, які ви відвідуєте і посилання, на які ви натискаєте на Веб-сайті. Наявність такої технічної інформації допомагає Фонду покращувати Веб-сайт.</p>
            <p>2.5. Фонд може використовувати Ваші персональні дані лише з метою та в цілях, визначених цією Політикою та чинним законодавством, зокрема (але не обмежуючись), 1) з метою обробки Вашого запиту (звернення) до Фонду, вчиненого за допомогою Веб-сайту, 2) з метою забезпечення надання Вами благодійної допомоги (пожертви) за допомогою опцій, доступних на Веб-сайті, 3) з метою реалізації інших статутних цілей Фонду в порядку, визначеному чинним законодавством.</p>
            <p>2.6. Фонд може накопичувати персональні дані, оброблені в процесі відвідування/використання Вами Вебсайту, в тому числі шляхом внесення цих даних до бази персональних даних. Зберігання Ваших персональних даних здійснюється із дотриманням вимог чинного законодавства в сфері персональних даних.</p>
            <p>2.7. Поширення Ваших персональних даних здійснюється виключно за Вашою згодою або у випадках, визначених цією Політикою та чинним законодавством.</p>
            <p>2.8. Ваші персональні дані підлягають видаленню або знищенню у разі:</p>
            <p>• закінчення 2-річного строку їх зберігання або іншого строку, визначеного чинним законодавством;</p>
            <p>• припинення правовідносин між суб’єктом персональних даних та Фондом, якщо інше передбачено законодавством;</p>
            <p>• в інших випадках, визначених чинним законодавством в сфері захисту персональних даних.</p>
            <p>2.9. Фонд не здійснює обробку персональних даних про расове або етнічне походження, політичні, релігійні або світоглядні переконання, членство в політичних партіях та професійних спілках, засудження до кримінального покарання, а також даних, що стосуються здоров’я, статевого життя, біометричних або генетичних даних, окрім випадків, визначених законодавством.</p>
          </div>
          <h3 className="modal__text-title">3. ПРАВА СУБ’ЄКТІВ ПЕРСОНАЛЬНИХ ДАНИХ</h3>
          <div className="modal__text-block">
            <p>3.1. При відвідуванні/користуванні Веб-сайтом Ви маєте право:</p>
            <p>• отримувати від Фонду інформацію, не визначену цією Політикою, щодо обробки, умов надання доступу до Ваших персональних даних, або дати відповідне доручення щодо отримання цієї інформації уповноваженими</p>
            <p>Вами особами, крім випадків, визначених законодавством;</p>
            <p>• на безоплатний доступ до своїх персональних даних;</p>
            <p>• отримати відповідь на запит щодо обробки Ваших персональних даних в порядку і в строк, визначений чинним законодавством;</p>
            <p>• пред’явити вмотивовану вимогу із запереченням проти обробки Ваших персональних даних, або щодо зміни або знищення Ваших персональних даних, якщо такі дані обробляються незаконно чи є недостовірними;</p>
            <p>• на захист своїх персональних даних від незаконної обробки та випадкової втрати, знищення, пошкодження у зв'язку з умисним приховуванням, ненаданням чи несвоєчасним їх наданням, а також на захист від надання відомостей, що є недостовірними чи ганьблять честь, гідність та ділову репутацію фізичної особи;</p>
            <p>• відкликати свою згоду на обробку персональних даних;</p>
            <p>а також користуватись іншими правами, визначеними чинним законодавством в сфері захисту персональних даних.</p>
            <p>3.2. Ви маєте право звернутись з питаннями, пов’язаними із збиранням, використанням, зберіганням та іншою обробкою Ваших персональних даних, до Уповноваженого Верховної Ради України з прав людини, із яким можна зв’язатись через адресу електронної пошти hotline@ombudsman.gov.ua. Якщо у вас виникли запитання щодо цієї Політики або якщо ви отримали будь-яке небажане електронне сповіщення, надіслане Фондом або начебто надіслане від імені Фонду, будь ласка, зв’яжіться з Фондом безпосередньо за адресою електронної пошти 3232605@gmail.com.</p>
          </div>
          <h3 className="modal__text-title">4. ЗМІНИ ПОЛІТИКИ КОНФІДЕНЦІЙНОСТІ</h3>
          <div className="modal__text-block">
            <p className="modal__text-title">4.1. Фонд залишає за собою право переглядати та змінювати положення даної Політики. Актуальна редакція цієї Політики розміщена на Веб-сайті за посиланням: __________________.></p>
          </div>
        </Modal.Body>
      </Modal>
    </div>
  )
}
