import React from 'react';
import './SuccessfulStories.scss';

export const FullDescriptionThird = () => {
  return (
    <div className="description__container">
        <p>Коли ми вперше поїхали до Купянська, ми познайомилися з старенькою жіночкою Тамарою.</p>
        <p>Усе своє життя вона провела на сцені, їздила з концертами разом із своїм колективом. І раптом, ця дієва творча людина опинилася у полоні жахливих обставин - війна, окупація, інвалідний візок...</p>
        <p>Тамара дуже мріяла знову ходити. І озвучила своє бажання так:</p>
        <p>“Дівчатка, може ви ходунки якісь мені знайдете? Так хочеться на вулицю виходити, свіжим повітрям подихати!”</p>
        <p>Наша команда звернулася по допомогу і керівниця ГО “Фенікс13” Наталія Меркулова передала нам ходунки. Вже у наступну поїздку ми привезли їх Тамарі.</p>
        <p>Для Тамари це було справжнє диво.</p>
        <p>Ми були щасливі, що змогли допомогти їй.</p>
    </div>
  )
}
