import React from 'react';
import './SuccessfulStories.scss';

export const FullDescriptionFirst = () => {
  return (
    <div className="description__container">
        <p>Знаєте, іноді наші волонтери стають справжніми чарівниками.</p>
        <p>Ці дівчата з деокупованої території Харківської області, що на фото, просто прийшли у місцевий магазин і ... отримали від наших волонтерів чудові подаруночки з нагоди новорічних свят. Їдучи повз магазин, волонтери побачили на вулиці дітей і вирішили їх порадувати.</p>
        <p>Зупинили авто, зайшли слідом за дітьми до магазину і на здивування всіх присутніх вручили дівчаткам подарункові коробочки, в яких лежали солодощі із Польщі і Німеччини, канцтовари,іграшки з різних міст України. Діти були дуже задоволені і довго дякували.</p>
        <p>Чарівниками бути просто! Особливо, коли є справжні друзі! Ми щиро вдячні кожному, хто допомагає нашій команді робити дітей з деокупації трохи щасливіше!</p>
    </div>
  )
}
