import React from 'react';
import './SuccessfulStories.scss';

export const FullDescriptionSecond = () => {
  return (
    <div className="description__container">
        <p>Наша команда має на меті допомогти тваринам, що залишилися без дому внаслідок війни.</p>
        <p>Тому ми регулярно закуповуємо корм і віддаємо його родинам, які дали прихисток безпритульним тваринам.</p>
        <p>На цьому фото - Григорій, Грицько, Гриць.</p>
        <p>Він прибіг до сільради Нижнього Бурлука разом із своїм малим чотирилапим другом і відразу привернув до себе нашу увагу. Він з радістю дозволив себе погладити і почухати.</p>
        <p>Мешканка села поділилася з нами його історією:</p>
        <p>“Ой, цей пес прийшов у наше село із українськими солдатами, жив у них, бо якось до них прибився. Може загубився, а може його залишили хазяї, не знаю. Потім солдати поїхали, а він знову залишився. Худий був страшне.”</p>
        <p>Ця історія має гарний кінець. Пес знайшов добру родину, що його прихистила. Але  таких покинутих тварин зараз багато, вони мерзнуть та голодують.</p>
        <p>Ми щиро вдячні нашим партнерам, які допомагають нам кормами для тварин. Це дуже важливо. Особливо взимку.</p>
    </div>
  )
}
